<a href="https://colab.research.google.com/github/Machocho254/Week-3-IP/blob/master/Moringa_Data_Science_Prep_W3_Independent_Project_2019_07_Machocho_Mengo_Python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
#Start with importing all the dictionaries
import pandas as pd
import numpy as np

In [138]:
# creating pandas dataframes 
#/content/cells_geo_description.xlsx

geo_descr = pd.read_excel('/content/cells_geo_description.xlsx', header = 0, sheet_name = 0)
geo_descr

     Column name                                        Description  Format
0         VILLES                                               City  String
1         STATUS                                  In Service or not  String
2   LOCALISATION                                  in ABIDJAN or not  String
3     DECOUPZONE                                  Geographical Zone  String
4       ZONENAME                                       Name of Zone  String
5      LONGITUDE                                          Longitude   Float
6       LATITUDE                                           Latitude   Float
7         REGION                                             Region  String
8           AREA                                               Area  String
9        CELL_ID                                     ID of the cell  String
10     SITE_CODE  Site (there are several cells per site, severa...  String

In [139]:
# to get the information about the dataframe created

geo_descr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 3 columns):
Column name    11 non-null object
Description    11 non-null object
Format         11 non-null object
dtypes: object(3)
memory usage: 392.0+ bytes

In [140]:
# get a description of the dataframe
geo_descr.describe()

       Column name Description  Format
count           11          11      11
unique          11          11       2
top      LONGITUDE        Area  String
freq             1           1       9

In [141]:
# Creating a second dataframe which gives an explanation of the column names
cdr_descr = pd.read_excel('/content/CDR_description.xlsx', header = 1, sheet_name = 0)
cdr_descr

           PRODUCT                                       Voice or SMS   String
0            VALUE                                      Billing price  Integer
1        DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
2     CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
3  DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String
4  DW_B_NUMBER_INT        Anonymized phone number of the counterparty   String
5        COUNTRY_A                  Country of party A (useless here)   String
6        COUNTRY_B                  Country of party B (useless here)   String
7          CELL_ID                                     ID of the cell   String
8          SITE_ID                                     ID of the SITE   String

In [142]:

# creating a dataframe that shows the geographical location of the cells id
cells_geo = pd.read_csv('/content/cells_geo.csv', sep='[;]' , engine= 'python')
cells_geo.rename(columns = {'SITE_CODE' : 'SITE_ID'}, inplace = True)
cells_geo.head()

   Unnamed: 0   VILLES      STATUS  ... AREA     CELL_ID     SITE_ID
0           0   ADJAME  In Service  ...  NaN  fbb2e75af3  0bb492ef17
1           1   ADJAME  In Service  ...  NaN  1502501d78  0bb492ef17
2           2   ADJAME  In Service  ...  NaN  0c2e182a0c  0bb492ef17
3           3  ASSINIE  In Service  ...  NaN  69bdfc69fd  8a1e6ce31f
4           4  ASSINIE  In Service  ...  NaN  7a1029d2ab  8a1e6ce31f

[5 rows x 12 columns]

In [143]:
telcom_1 = pd.read_csv('/content/Telcom_dataset (1).csv')
telcom_1.rename(columns= {'PRODUTC':'PRODUCT', 'DATETIME':'DATE_TIME', 'DW_A_NUMBER_INT':'DW_A_NUMBER', 'DW_B_NUMBER_INT':'DW_B_NUMBER'}, inplace=True)
telcom_1.head()
# creating a dataframe from the given csv file

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [144]:
telcom_1.describe()
# to get the exploratory description of the dataframe

             VALUE
count  5001.000000
mean     25.869626
std     101.934502
min       0.000000
25%       0.000000
50%       0.000000
75%      25.000000
max    4440.000000

In [145]:
telcom_2 = pd.read_csv('/content/Telcom_dataset2 (1).csv')
telcom_2
# creating a dataframe

     PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0        sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1      Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2        sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
3      Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
4        sms     25  2012-05-07 23:04:58.0  ...     19e2e  +bO+qkSonO  +bO+qkSonO
...      ...    ...                    ...  ...       ...         ...         ...
4996     sms      0  2012-05-08 00:01:53.0  ...     19e2e  896459aace  b7d00e59e4
4997     sms     25  2012-05-08 00:01:53.0  ...     19e2e  7e90b35166  211015b14d
4998     sms      0  2012-05-08 00:01:53.0  ...     19e2e  fe70e431df  c7ea989264
4999    data      0  2012-05-08 00:01:53.0  ...     OTHER  ffa6759bb2         NaN
5000   Voice      0  2012-05-08 00:01:53.0  ...     19e2e  8630058aca  b47a998a3e

[5001 rows x 10 columns]

In [146]:
telcom_2.describe()
# to get the exploratody data description of the dataframe

             VALUE
count  5001.000000
mean     24.334933
std      97.471586
min       0.000000
25%       0.000000
50%       0.000000
75%      25.000000
max    3380.000000

In [147]:
telcom_3 = pd.read_csv('/content/Telcom_dataset3 (1).csv')
telcom_3.rename(columns= {'DW_A_NUMBER_INT':'DW_A_NUMBER', 'DW_B_NUMBER_INT':'DW_B_NUMBER','CELLID':'CELL_ID','SIET_ID':'SITE_ID'}, inplace=True)
telcom_3.head()
# creating the name of the data given.

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  2012-05-08 23:03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA

[5 rows x 10 columns]

In [148]:
telcom_3.describe()
# get the exploratory description of the data given

              VALUE
count   5001.000000
mean      26.441512
std      224.200217
min        0.000000
25%        0.000000
50%        0.000000
75%       25.000000
max    12900.000000

In [149]:
!pwd

/content

In [150]:
!git clone https://github.com/Machocho254/Week-3-IP.git

fatal: destination path 'Week-3-IP' already exists and is not an empty directory.

In [151]:
!git clone https://github.com/Machocho254/Week-3-IP.git

fatal: destination path 'Week-3-IP' already exists and is not an empty directory.

In [152]:
# Average use of voice bundle in the first dataframe
telcom_1[telcom_1['PRODUCT'] == 'Voice'].VALUE.mean()

49.06219017575484

In [153]:
# # Average use of voice bundle in the second dataframe
telcom_2[telcom_2['PRODUCT'] == 'Voice'].VALUE.mean()

54.29485834207765

In [154]:
telcom_3[telcom_3['PRODUCT'] == 'Voice'].VALUE.mean()
# Average use of voice bundle in the third dataframe

65.04737183646982

In [0]:
# OUt of all the three datasets, the

In [156]:
# Average use of the sms bundle in the first dataframe
telcom_1[telcom_1['PRODUCT'] == 'sms'].VALUE.mean()

6.821772151898734

In [157]:
telcom_2[telcom_2['PRODUCT'] == 'sms'].VALUE.mean()
# Average use of the sms bundle in the second dataframe

5.458565908115071

In [158]:
telcom_3[telcom_3['PRODUCT'] == 'sms'].VALUE.mean()
# Average use of the sms bundle in the third dataframe

9.84495843874232

In [159]:
# To filter the data to use, we shall select the Product, VALUES, DATETIME and CELL ID columns

df1 = telcom_1[["PRODUCT","VALUE","DATE_TIME", "CELL_ID"]]
df1

     PRODUCT  VALUE              DATE_TIME     CELL_ID
0      Voice      0  2012-05-06 23:04:37.0  /TJNe+Mmtu
1        sms      0  2012-05-06 23:05:25.0  /+cKZKIp41
2        sms     25  2012-05-06 23:05:41.0  /u0FSD+ahi
3      Voice     56  2012-05-06 23:05:42.0  +cNeJzsTp3
4      Voice     14  2012-05-06 23:06:29.0  051KhYDCpv
...      ...    ...                    ...         ...
4996     sms    100  2012-05-07 00:01:54.0  0c2371d9bc
4997   Voice      1  2012-05-07 00:01:54.0  5fb791cf56
4998   Voice      0  2012-05-07 00:01:54.0  7773627c12
4999   Voice      0  2012-05-07 00:01:54.0  3f4af49d6c
5000   Voice      7  2012-05-07 00:01:54.0  6f4d9b77a5

[5001 rows x 4 columns]

In [160]:
df1[df1['PRODUCT'] == "sms"].count()
# to get the total number of sms

PRODUCT      1975
VALUE        1975
DATE_TIME    1975
CELL_ID      1975
dtype: int64

In [161]:
df1[df1['PRODUCT'] == 'Voice'].count()
# to get the total number of voice calls

PRODUCT      2219
VALUE        2219
DATE_TIME    2219
CELL_ID      2219
dtype: int64

In [162]:

df2 = telcom_2[["PRODUCT","VALUE","DATE_TIME", "CELL_ID"]]
df2
# filter data to only have useful columns

     PRODUCT  VALUE              DATE_TIME     CELL_ID
0        sms      0  2012-05-07 23:02:06.0  +854AcBQT2
1      Voice      0  2012-05-07 23:03:44.0  +854AcBQT2
2        sms      0  2012-05-07 23:04:06.0  +laSrk7g6q
3      Voice     37  2012-05-07 23:04:48.0  /xvRrCVKoQ
4        sms     25  2012-05-07 23:04:58.0  +bO+qkSonO
...      ...    ...                    ...         ...
4996     sms      0  2012-05-08 00:01:53.0  896459aace
4997     sms     25  2012-05-08 00:01:53.0  7e90b35166
4998     sms      0  2012-05-08 00:01:53.0  fe70e431df
4999    data      0  2012-05-08 00:01:53.0  ffa6759bb2
5000   Voice      0  2012-05-08 00:01:53.0  8630058aca

[5001 rows x 4 columns]

In [163]:
df2[df2['PRODUCT'] == "sms"].count()
# to get the total number of sms

PRODUCT      2329
VALUE        2329
DATE_TIME    2329
CELL_ID      2329
dtype: int64

In [164]:
df2[df2['PRODUCT'] == "Voice"].count()
# to get the total number of voice calls

PRODUCT      1906
VALUE        1906
DATE_TIME    1906
CELL_ID      1906
dtype: int64

In [165]:
df3 = telcom_3[["PRODUCT","VALUE","DATE_TIME", "CELL_ID"]]
df3
# filtering the dataframe

     PRODUCT  VALUE              DATE_TIME     CELL_ID
0      Voice     61  2012-05-08 23:01:28.0  +38u2u/rfx
1        sms      0  2012-05-08 23:01:31.0  +Fs4mTvdKx
2      Voice     10  2012-05-08 23:02:59.0  +ZaaZozy/+
3        sms      0  2012-05-08 23:03:04.0  +cNeJzsTp3
4      Voice     22  2012-05-08 23:03:16.0  /eeMklgyJA
...      ...    ...                    ...         ...
4996   Voice      0  2012-05-09 00:01:43.0  2aa04dcab7
4997   Voice     62  2012-05-09 00:01:43.0  7f1f2f889f
4998   Voice     32  2012-05-09 00:01:43.0  a4731e780e
4999   Voice     30  2012-05-09 00:01:43.0  98ed726da2
5000   Voice     60  2012-05-09 00:01:43.0  1c11a2fcbb

[5001 rows x 4 columns]

In [166]:
df3[df3['PRODUCT'] == "sms"].count()
# to get the total number of sms

PRODUCT      2767
VALUE        2767
DATE_TIME    2767
CELL_ID      2767
dtype: int64

In [167]:
df3[df3['PRODUCT'] == "Voice"].count()
# to get the total number of voice calls

PRODUCT      1541
VALUE        1541
DATE_TIME    1541
CELL_ID      1541
dtype: int64

In [168]:
# To get the most used infrastructure, we get the most used site 
df1[df1['PRODUCT'] == "Voice"].CELL_ID.max()

'ffcc507579'

In [169]:
df1[df1['PRODUCT'] == "sms"].CELL_ID.max()
# To get the most used infrastructure, we get the most used site

'ffcc507579'

In [170]:
df2[df2['PRODUCT'] == "Voice"].CELL_ID.max()
# To get the most used infrastructure, we get the most used site

'ffb86d66d2'

In [171]:
df2[df2['PRODUCT'] == "sms"].CELL_ID.max()
# To get the most used infrastructure, we get the most used site

'ffcc507579'

In [172]:
df3[df3['PRODUCT'] == "Voice"].CELL_ID.max()
# To get the most used infrastructure, we get the most used site

'fed537f3b2'

In [173]:
df3[df3['PRODUCT'] == "sms"].CELL_ID.max()
# To get the most used infrastructure, we get the most used site

'ff99709d62'

In [0]:
#

In [0]:
cells_geo[cells_geo['STATUS'] == "In Service"].count()

Unnamed: 0      3907
VILLES          3907
STATUS          3907
LOCALISATION    3907
DECOUPZONE      3907
ZONENAME        3901
LONGITUDE       3907
LATITUDE        3907
REGION          3907
AREA            3886
CELL_ID         3907
SITE_ID         3907
dtype: int64

In [177]:
cells_geo.columns.str.split(';').str[0].tolist()
['VILLES','STATUS','LOCALISATION','DECOUPZONE','ZONENAME','LONGITUDE','LATITUDE','REGION','AREA','CELL_ID','SITE_CODE']

['VILLES',
 'STATUS',
 'LOCALISATION',
 'DECOUPZONE',
 'ZONENAME',
 'LONGITUDE',
 'LATITUDE',
 'REGION',
 'AREA',
 'CELL_ID',
 'SITE_CODE']

In [178]:
#merging 1, 2, 3 datasets
frames = [telcom_1, telcom_2, telcom_3]
df4 = pd.concat(frames)
df4.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [179]:
df5 = pd.merge(df4,cells_geo, on =('CELL_ID','SITE_ID'), how = 'outer')
df5.head()

  PRODUCT  VALUE              DATE_TIME  ... LATITUDE REGION AREA
0   Voice    0.0  2012-05-06 23:04:37.0  ...      NaN    NaN  NaN
1     sms    0.0  2012-05-06 23:40:48.0  ...      NaN    NaN  NaN
2     sms    0.0  2012-05-07 23:32:47.0  ...      NaN    NaN  NaN
3     sms    0.0  2012-05-07 23:52:21.0  ...      NaN    NaN  NaN
4    data    0.0  2012-05-07 23:53:21.0  ...      NaN    NaN  NaN

[5 rows x 20 columns]

In [102]:
df5.drop_duplicates() #checking for duplicate values
df5.isna() #checking for missing values number
df5.drop(['Unnamed: 0', 'VILLES','STATUS','LOCALISATION','DECOUPZONE','ZONENAME','LONGITUDE','LATITUDE','REGION','AREA', 'COUNTRY_A', 'COUNTRY_B'], axis = 1) #dropping columns
df6 = df5.dropna(how = "any") #drops records with any missing values
df6

Empty DataFrame
Columns: [PRODUCT, VALUE, DATE_TIME, CELL_ON_SITE, DW_A_NUMBER, DW_B_NUMBER, COUNTRY_A, COUNTRY_B, CELL_ID, SITE_ID, Unnamed: 0, VILLES, STATUS, LOCALISATION, DECOUPZONE, ZONENAME, LONGITUDE, LATITUDE, REGION, AREA]
Index: []

In [0]:
#confirming that all null records have been dropped
df6.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 0 entries
Data columns (total 26 columns):
CELLID             0 non-null object
CELL_ID            0 non-null object
CELL_ON_SITE       0 non-null object
COUNTRY_A          0 non-null object
COUNTRY_B          0 non-null object
DATETIME           0 non-null object
DATE_TIME          0 non-null object
DW_A_NUMBER        0 non-null object
DW_A_NUMBER_INT    0 non-null object
DW_B_NUMBER        0 non-null object
DW_B_NUMBER_INT    0 non-null object
PRODUCT            0 non-null object
PRODUTC            0 non-null object
SIET_ID            0 non-null object
SITE_ID            0 non-null object
VALUE              0 non-null float64
Unnamed: 0         0 non-null float64
VILLES             0 non-null object
STATUS             0 non-null object
LOCALISATION       0 non-null object
DECOUPZONE         0 non-null object
ZONENAME           0 non-null object
LONGITUDE          0 non-null float64
LATITUDE           0 non-null float64
REGION             0 non-null object
AREA               0 non-null object
dtypes: float64(4), object(22)
memory usage: 0.0+ bytes

In [103]:
# grouping values
df5['VALUE'].groupby(df5['PRODUCT']).mean()

PRODUCT
Voice    55.169961
data      7.628861
sms       7.555791
Name: VALUE, dtype: float64

In [109]:
df5[['DATE','TIME']] = df5.DATE_TIME.str.split(expand=True) 
df5.head()

  PRODUCT  VALUE              DATE_TIME  ...        Time        DATE        TIME
0   Voice    0.0  2012-05-06 23:04:37.0  ...  23:04:37.0  2012-05-06  23:04:37.0
1     sms    0.0  2012-05-06 23:40:48.0  ...  23:40:48.0  2012-05-06  23:40:48.0
2     sms    0.0  2012-05-07 23:32:47.0  ...  23:32:47.0  2012-05-07  23:32:47.0
3     sms    0.0  2012-05-07 23:52:21.0  ...  23:52:21.0  2012-05-07  23:52:21.0
4    data    0.0  2012-05-07 23:53:21.0  ...  23:53:21.0  2012-05-07  23:53:21.0

[5 rows x 24 columns]

In [110]:
# we select product, value, time, cell_id and VILLES from df5
df6 = df5[["PRODUCT","VALUE","TIME", "CELL_ID", "VILLES"]]
df6

      PRODUCT  VALUE        TIME     CELL_ID    VILLES
0       Voice    0.0  23:04:37.0  /TJNe+Mmtu       NaN
1         sms    0.0  23:40:48.0  /TJNe+Mmtu       NaN
2         sms    0.0  23:32:47.0  /TJNe+Mmtu       NaN
3         sms    0.0  23:52:21.0  /TJNe+Mmtu       NaN
4        data    0.0  23:53:21.0  /TJNe+Mmtu       NaN
...       ...    ...         ...         ...       ...
18972     NaN    NaN         NaN  1cfc2d7ab1  ZUENOULA
18973     NaN    NaN         NaN  3ae1708153  ZUENOULA
18974     NaN    NaN         NaN  cb71f8a29c  ZUENOULA
18975     NaN    NaN         NaN  d4a6a0b645  ZUENOULA
18976     NaN    NaN         NaN  f9f3e42589  ZUENOULA

[18977 rows x 5 columns]

In [113]:
df6.describe()

              VALUE
count  15003.000000
mean      25.548690
std      152.916219
min        0.000000
25%        0.000000
50%        0.000000
75%       25.000000
max    12900.000000

In [118]:
# from the above dataframe, we find out the peak and off peak time per city/ville and site_id
peak = df5[df5["VALUE"] >= 25].TIME

off_peak = df5[df5["VALUE"] <= 10].TIME
# filtering data 
# df.where(filter, inplace = True) 
print(peak)
# # display 
# df.Total.mean()

11       23:05:41.0
12       23:13:03.0
17       23:05:42.0
27       23:13:18.0
28       23:20:17.0
            ...
14990    00:01:40.0
14992    00:01:40.0
14995    00:01:42.0
14996    00:01:42.0
15000    00:01:43.0
Name: TIME, Length: 4427, dtype: object

In [119]:
# we print the off_peak hours
print(off_peak)

0        23:04:37.0
1        23:40:48.0
2        23:32:47.0
3        23:52:21.0
4        23:53:21.0
            ...
14994    00:01:42.0
14997    00:01:42.0
14999    00:01:43.0
15001    00:01:43.0
15002    00:01:43.0
Name: TIME, Length: 9662, dtype: object

In [112]:
# Which 5 cells/site generate the most revenue?
#
df5_new = df5.groupby('CELL_ID')['VALUE'].sum()
df5_new
df5_new.sort_values(ascending=False).iloc[:5]

#This will gives us the first 5 infrastructure sites that we need to prioritize during the upgrade.
# These are based on being the most profitable sites of all

CELL_ID
ffa6759bb2    15286.0
2def69183e    12900.0
3f5ac97214     6850.0
MpOhP3OKNN     4225.0
5a7f6cf0fa     3437.0
Name: VALUE, dtype: float64